ITHACA-FV/tutorials/CFD/11UnsteadyBBOpen/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
22000
(
(0.000406221 -0.000406221 0)
(0.00121825 -0.000405809 0)
(0.00202905 -0.000404986 0)
(0.00283778 -0.000403751 0)
(0.00364364 -0.000402108 0)
(0.00444581 -0.000400058 0)
(0.00524347 -0.000397603 0)
(0.00603581 -0.000394746 0)
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
